[
  {
    "company": "DATADOG",
    "question_type": "Information Extraction",
    "question_type_kr": "정보 추출",
    "question_en": "By drawing conclusions from the information stated only in the income statement, what is Datadog's FY2021 net income attributable to shareholders (in USD millions)?",
    "question_kr": "손익 계산서의 정보만을 바탕으로 결론을 내릴 때, 2021 회계 연도에 주주에게 귀속되는 Datadog의 순이익은 얼마입니까(미화 백만 달러 기준)?",
    "answer_en": "Datadog reported a net loss in FY2021. The net loss amounted to $20.745 (in USD millions)",
    "answer_kr": "Datadog는 2021 회계연도(FY2021)에서 순손실을 보고했습니다. 순손실은 2,074만 5천 달러(미화)였습니다.",
    "justification_en": "This information was found within the company's 10-K, in their statements of comprehensive loss as well as statements of operations.",
    "justification_kr": "이 정보는 회사의 10-K 보고서에서 포괄손익계산서와 손익계산서에 포함되어 있습니다.",
    "evidence": [
      {
        "source": "/korean_docs/DATADOG_FY2021_10K.pdf",
        "page_number": 58,
        "full_page_text": "DATADOG, INC.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except share and per share data)\nDecember 31,\n2021December 31,\n2020\nASSETS\nCURRENT ASSETS:\nCash and cash equivalents $ 270,973 $ 224,927 \nMarketable securities 1,283,473 1,292,532 \nAccounts receivable, net of allowance for credit losses of $2,997 and $2,468 as of December 31, 2021 and 2020,\nrespectively 268,824 163,359 \nDeferred contract costs, current 23,235 13,638 \nPrepaid expenses and other current assets 24,443 23,624 \nTotal current assets 1,870,948 1,718,080 \nProperty and equipment, net 75,152 47,197 \nOperating lease assets 61,355 57,829 \nGoodwill 292,176 17,609 \nIntangible assets, net 15,704 2,069 \nDeferred contract costs, non-current 42,062 26,750 \nRestricted cash 3,490 3,784 \nOther assets 19,907 16,967 \nTOTAL ASSETS $ 2,380,794 $ 1,890,285 \nLIABILITIES AND ST OCKHOLDERS' EQUITY\nCURRENT LIABILITIES:\nAccounts payable $ 25,270 $ 21,342 \nAccrued expenses and other current liabilities 111,284 55,351 \nOperating lease liabilities, current 20,157 16,326 \nDeferred revenue, current 371,985 204,825 \nTotal current liabilities 528,696 297,844 \nOperating lease liabilities, non-current 52,106 51,433 \nConvertible senior notes, net 735,482 575,864 \nDeferred revenue, non-current 13,896 3,450 \nOther liabilities 9,411 4,262 \nTotal liabilities 1,339,591 932,853 \nCOMMITMENTS AND CONTINGENCIES (NOTE 10)\nSTOCKHOLDERS' EQUITY :\nClass A common stock, $0.00001 par value per share; 2,000,000,000 shares authorized as of December 31, 2021 and 2020;\n263,339,585 and 218,510,509 shares issued and outstanding as of December 31, 2021 and 2020, respectively 2 2 \nClass B common stock, $0.00001 par value per share; 310,000,000 shares authorized as of December 31, 2021 and 2020;\n50,025,852 and 87,369,554 shares issued and outstanding as of December 31, 2021 and 2020, respectively 1 1 \nAdditional paid-in capital 1,197,136 1,103,305 \nAccumulated other comprehensive (loss) income (3,830) 2,287 \nAccumulated deficit (152,106) (148,163)\nTotal stockholders’ equity 1,041,203 957,432 \nTOTAL LIABILITIES AND ST OCKHOLDERS' EQUITY $ 2,380,794 $ 1,890,285 \nSee accompanying notes to consolidated financial statements.\n57"
      },
      {
        "source": "/korean_docs/DATADOG_FY2021_10K.pdf",
        "page_number": 59,
        "full_page_text": "DATADOG, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share data)\nYear Ended December 31,\n2021 2020 2019\nRevenue $ 1,028,784 $ 603,466 $ 362,780 \nCost of revenue 234,245 130,197 88,949 \nGross profit 794,539 473,269 273,831 \nOperating expenses:\nResearch and development 419,769 210,626 111,425 \nSales and marketing 299,497 213,660 146,657 \nGeneral and administrative 94,429 62,756 35,889 \nTotal operating expenses 813,695 487,042 293,971 \nOperating loss (19,156) (13,773) (20,140)\nOther income (loss):\nInterest expense (21,052) (30,434) (32)\nInterest income and other income, net 21,786 21,985 4,196 \nOther income (loss), net 734 (8,449) 4,164 \nLoss before provision for income taxes (18,422) (22,222) (15,976)\nProvision for income taxes (2,323) (2,325) (734)\nNet loss $ (20,745)$ (24,547)$ (16,710)\nNet loss attributable to common stockholders $ (20,745)$ (24,547)$ (16,710)\nBasic and diluted net loss per share $ (0.07)$ (0.08)$ (0.12)\nWeighted average shares used in calculating basic and diluted net loss per share: 309,048 300,350 139,873 \nSee accompanying notes to consolidated financial statements.\n58"
      }
    ]
  },
  {
    "company": "DATADOG",
    "question_type": "Information Extraction",
    "question_type_kr": "정보 추출",
    "question_en": "What industry does Datadog primarily operate in?",
    "question_kr": "Datadog은 주로 어떤 산업에서 운영되나요?",
    "answer_en": "Datadog operates within the software as a service (SaaS) industry.",
    "answer_kr": "Datadog는 소프트웨어 서비스(SaaS) 산업 내에서 운영됩니다.",
    "justification_en": "This information was extrapolated from their Business Overview section within their 10-K.",
    "justification_kr": "이 정보는 회사의 10-K 보고서 내 사업 개요 섹션에서 추출되었습니다.",
    "evidence": [
      {
        "source": "/korean_docs/DATADOG_FY2021_10K.pdf",
        "page_number": 5,
        "full_page_text": "MARKET, INDUSTRY AND OTHER DATA\nThe statistical data, estimates and forecasts referenced throughout this Annual Report on Form 10-K are based on independent industry\npublications or other publicly available information, as well as information based on our internal sources. While we believe the industry and market data\nincluded in this Annual Report on Form 10-K are reliable and are based on reasonable assumptions, these data involve many assumptions and limitations,\nand you are cautioned not to give undue weight to these estimates. We have not independently verified the accuracy or completeness of the data contained\nin these industry publications and other publicly available information. None of the industry publications referred to in this Annual Report on Form 10-K\nwere prepared on our or on our affiliates’ behalf or at our expense. The industry in which we operate is subject to a high degree of uncertainty and risk due\nto a variety of factors, including those described in the section titled “Risk Factors” and “Special Note Regarding Forward-Looking Statements,” that could\ncause results to differ materially from those expressed in these publications and other publicly available information.\nThe Gartner content referenced herein (the “Gartner Content”) represents research opinion or viewpoints published, as part of a syndicated\nsubscription service, by Gartner, Inc. (“Gartner”), and are not representations of fact. The Gartner Content speaks as of its original publication date (and not\nas of the date of this Annual Report on Form 10-K) and the opinions expressed in the Gartner Content are subject to change without notice.\n4"
      }
    ]
  },
  {
    "company": "DATADOG",
    "question_type": "Numerical Reasoning",
    "question_type_kr": "숫자 추론",
    "question_en": "Has Datadog increased its debt on balance sheet between FY2023 and the FY2022 period?",
    "question_kr": "Datadog의 재무제표상 부채가 FY2023과 FY2022 기간 사이에 증가했나요?",
    "answer_en": "Yes, Datadog's debt on their balance sheet has increased. Although they do not report any short-term or long-term debt, their total liabilities has increased from $1,594.3 (in USD millions) in 2022, to $1,910.7 (in USD millions) in 2023.",
    "answer_kr": "네, Datadog의 재무제표에서 부채가 증가했습니다. 비록 단기 부채나 장기 부채는 보고되지 않았지만, 총 부채는 2022년 15억 9,430만 달러(미화)에서 2023년 19억 1,070만 달러(미화)로 증가했습니다.",
    "justification_en": "This information was extracted from company's FY2023 10-K, specifically within the consolidated balance sheets.",
    "justification_kr": "이 정보는 회사의 2023 회계연도 10-K 보고서에서 추출되었으며, 특히 연결 재무상태표 내에서 찾을 수 있습니다.",
    "evidence": [
      {
        "source": "/korean_docs/DATADOG_FY2023_10K.pdf",
        "page_number": 59,
        "full_page_text": "Given the complexity of the Company’s subscription services contracts with certain customers, coupled with management’s judgments involved in\nidentifying distinct performance obligations and non-standard terms and conditions, auditing the Company’s subscription services contracts with certain\ncustomers required a high degree of auditor judgment.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Company’s subscription contracts with certain customers included, among others:\n◦ We obtained an understanding, evaluated the design, and tested the operating effectiveness of management’s controls over revenue recognition. This\nincludes management’s controls over the identification of performance obligations and non-standard terms and conditions in subscription contracts,\nas well as the allocation of revenue to each performance obligation.\n◦ We evaluated a sample of subscription contracts with customers to determine if all the promises referred to in the contract were properly identified\nby management and accounted for as distinct performance obligations by performing the following:\n• Obtained and read the subscription contract and independently assessed the terms of the contract to identify all promises and non-standard\nterms and conditions.\n• For each promise identified, we evaluated whether such promise represented a distinct “performance obligation”, as prescribed by\nAccounting Standards Codification Topic 606, Revenue from Contracts with Customers.\n• We evaluated the completeness and accuracy of the performance obligations by comparing those identified by us to those identified by\nmanagement.\n/s/ Deloitte & Touche LLP\nNew York, New York\nFebruary 23, 2024 \nWe have served as the Company's auditor since 2016.\n58"
      }
    ]
  },
  {
    "company": "DATADOG",
    "question_type": "Logical Reasoning",
    "question_type_kr": "논리적 추론",
    "question_en": "Does Datadog have a reasonably healthy liquidity profile based on its quick ratio for FY2023? If the quick ratio is not relevant to measure liquidity, please state that and explain why.",
    "question_kr": "Datadog은 2023 회계연도의 당좌 비율에 근거하여 유동성 프로필이 상당히 건전한가요? 당좌 비율이 유동성 측정과 관련이 없는 경우, 그 이유를 설명해 주세요.",
    "answer_en": "Yes Datadog has a healthy liquidity profile based on their quick ratio for FY2023 as it is 3.08. Generally, any number greater than 1 is considered healthy as it indicates that the company would sufficiently be able to cover their current liabilities with their most liquid assets should any circumstance require. Datadog has a very healthy ratio as it is more than 3 times enough to cover the company's current liabilities. There is no reason to indicate that the quick ratio may not be the most ideal to measure Datadog's liquidity, so it has been used here.",
    "answer_kr": "네, Datadog는 2023 회계연도(FY2023) 기준으로 당좌 비율이 3.08로 건강한 유동성 프로필을 보이고 있습니다. 일반적으로 1보다 큰 수치는 건강한 것으로 간주되며, 이는 회사가 가장 유동적인 자산으로 현재 부채를 충분히 상환할 수 있다는 것을 의미합니다.  Datadog는 현재 부채를 3배 이상 충분히 커버할 수 있는 매우 건강한 비율을 보이고 있습니다. 당좌 비율이  Datadog의 유동성을 측정하는 데 적합한 지표이므로, 이 지표가 여기서 사용되었습니다.",
    "justification_en": "The quick ratio formula is (cash & cash equivalents + marketable securities + accounts receivable) / current liabilities. Using this formula, the following quick ratio was computed (in USD thousands):\nFY2023 Quick Ratio = (330,339 + 2,252,559 + 509,279) / 1,003,052 = 3.08\nThese numbers were pulled from the consolidated balance sheets.",
    "justification_kr": "당좌 비율 공식은 (현금 및 현금성 자산 + 매도가능 증권 + 매출채권) / 유동부채입니다. 이 공식을 사용하여 다음과 같은 당좌 비율을 계산하였습니다 (단위: 미화 천 달러): 2023 회계연도 당좌 비율 = (330,339 + 2,252,559 + 509,279) / 1,003,052 = 3.08 이 숫자는 연결 재무상태표에서 추출되었습니다.",
    "evidence": [
      {
        "source": "/korean_docs/DATADOG_FY2023_10K.pdf",
        "page_number": 59,
        "full_page_text": "Given the complexity of the Company’s subscription services contracts with certain customers, coupled with management’s judgments involved in\nidentifying distinct performance obligations and non-standard terms and conditions, auditing the Company’s subscription services contracts with certain\ncustomers required a high degree of auditor judgment.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Company’s subscription contracts with certain customers included, among others:\n◦ We obtained an understanding, evaluated the design, and tested the operating effectiveness of management’s controls over revenue recognition. This\nincludes management’s controls over the identification of performance obligations and non-standard terms and conditions in subscription contracts,\nas well as the allocation of revenue to each performance obligation.\n◦ We evaluated a sample of subscription contracts with customers to determine if all the promises referred to in the contract were properly identified\nby management and accounted for as distinct performance obligations by performing the following:\n• Obtained and read the subscription contract and independently assessed the terms of the contract to identify all promises and non-standard\nterms and conditions.\n• For each promise identified, we evaluated whether such promise represented a distinct “performance obligation”, as prescribed by\nAccounting Standards Codification Topic 606, Revenue from Contracts with Customers.\n• We evaluated the completeness and accuracy of the performance obligations by comparing those identified by us to those identified by\nmanagement.\n/s/ Deloitte & Touche LLP\nNew York, New York\nFebruary 23, 2024 \nWe have served as the Company's auditor since 2016.\n58"
      }
    ]
  },
  {
    "company": "MONGODB",
    "question_type": "Information Extraction",
    "question_type_kr": "정보 추출",
    "question_en": "What is the FY2022 COGS for MongoDB? Please state answer in USD millions. Provide a response to the question by primarily using the statement of income.",
    "question_kr": "MongoDB의 FY2022 COGS는 얼마입니까? 백만 달러 단위로 답변해 주세요. 주로 손익 계산서를 사용하여 질문에 대한 답변을 제공하세요.",
    "answer_en": "The FY2022 cost of revenue (which is used in place of COGS for MongoDB) is $349.304 (in USD millions). \n\nNote: MongoDB's business year-end is not Dec 31 but rather Jan 31. As such, their COGS for Jan 31, 2023 was used as this encapsulates majority of the year of 2022.",
    "answer_kr": "2022 회계연도의 매출원가(MongoDB의 경우 COGS 대신 사용됨)는 3억 4,930만 달러(미화)입니다.\n\n참고: MongoDB의 사업 연도는 12월 31일이 아니라 1월 31일입니다. 따라서 2023년 1월 31일의 COGS가 사용되었으며, 이는 2022년의 대부분을 포함하고 있습니다.",
    "justification_en": "This information was found within the consolidated statements of operations, under the line item \"total cost of revenue\".",
    "justification_kr": "이 정보는 연결 손익계산서에서 \"총 매출원가(total cost of revenue)\" 항목에서 찾을 수 있습니다.",
    "evidence": [
      {
        "source": "/korean_docs/MONGODB_FY2022_10K.pdf",
        "page_number": 68,
        "full_page_text": "Table of Contents\ncompany; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets\nthat could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of\neffectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance\nwith the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or\nrequired to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and\n(ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on\nthe consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the\ncritical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition - Allocation of Transaction Price in Revenue Arrangements with Multiple Performance Obligations\nAs described in Notes 2 and 10 to the consolidated financial statements, other subscription revenue was $426.9 million for the year ended January 31, 2023.\nCertain of the Company’s contracts with customers contain multiple performance obligations, such as the license portion of time-based software licenses, post-\ncontract customer support, and services. For these contracts that contain multiple performance obligations, management allocates the transaction price to each\nperformance obligation based on a relative standalone selling price. Management determines each standalone selling price based on multiple factors, including\npast history of selling such performance obligations as standalone products. Management estimates standalone selling price for performance obligations with no\nobservable evidence using adjusted market, cost plus and residual methods to establish the standalone selling prices. In cases where directly observable\nstandalone sales are not available, management utilizes all observable data points including competitor pricing for a similar or identical product, market and\nindustry data points, and the Company’s pricing practices.\nThe principal considerations for our determination that performing procedures relating to revenue recognition - allocation of transaction price in revenue\narrangements with multiple performance obligations is a critical audit matter are (i) the significant judgment by management in estimating the standalone selling\nprice for certain of the Company’s performance obligations and allocating the transaction price based on a relative allocation of standalone selling price to those\nindividual performance obligations, which in turn led to (ii) significant auditor judgment, subjectivity and effort in performing procedures and evaluating\nmanagement’s estimates of standalone selling price and the allocation of transaction price to the individual performance obligations.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated\nfinancial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process, including controls over the\nestimation of the standalone selling price and the allocation of transaction price to the individual performance obligations. These procedures also included\ntesting management’s process for estimating the standalone selling prices, which involved (i) evaluating the appropriateness of the methodologies used by\nmanagement in establishing the standalone selling prices; (ii) assessing the reasonableness of the significant assumptions developed by management; and (iii)\ntesting the source data utilized in management’s estimate calculations. These procedures also included testing the relative allocation of transaction price to\nindividual performance obligations based on a sample of contracts.\n/s/ PricewaterhouseCoopers LLP\nSan Jose, California\nMarch 17, 2023\nWe have served as the Company's auditor since 2013.\n66"
      }
    ]
  },
  {
    "company": "MONGODB",
    "question_type": "Information Extraction",
    "question_type_kr": "정보 추출",
    "question_en": "What are the geographies that MongoDB primarily operates in as of FY2023?",
    "question_kr": "2023 회계연도 기준으로 MongoDB가 주로 운영되는 지역은 어디인가요?",
    "answer_en": "The geographies that MongoDB primarily operates in for FY2023 are the following 3 areas: Americas (North America and South America), EMEA (Europe, Middle East, and Africa), and Asia Pacific.",
    "answer_kr": "MongoDB가 2023 회계연도(FY2023) 동안 주로 운영하는 곳은 다음의 세 지역입니다: 미주(북미와 남미), EMEA(유럽, 중동, 아프리카), 아시아 태평양 지역.",
    "justification_en": "This information was stated within their 10-K under the notes to consolidated financial statements section. Within note 9, their disaggregation of revenue, they plainly state \"the company’s primary geographical markets are North and South America (“Americas”); Europe, Middle East and Africa (“EMEA”); and Asia Pacific.",
    "justification_kr": "이 정보는 회사의 10-K 보고서 연결 재무제표 주석 섹션에 명시되어 있습니다. 주석 9, 수익의 세분화 항목에서, 회사는 \"회사의 주요 지리적 시장은 북미 및 남미(‘미주’), 유럽, 중동 및 아프리카(‘EMEA’), 아시아 태평양 지역(‘아시아 태평양’)\"이라고 명확히 언급하고 있습니다.",
    "evidence": [
      {
        "source": "/korean_docs/MONGODB_FY2023_10K.pdf",
        "page_number": 94,
        "full_page_text": "Table of Contents\nMONGODB, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\nSupplemental Information\nThe following table presents supplemental information related to the Company’s finance and operating leases (in thousands, except weighted-average\ninformation):\nYears Ended January 31,\n2024 2023\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from finance lease $ 2,590 $ 2,891 \nOperating cash flows from operating leases 12,336 11,932 \nFinancing cash flows from finance lease 5,483 4,510 \nRight-of-use assets obtained in exchange for lease obligations:\nOperating leases 5,537 9,346 \nWeighted-average remaining lease term (in years):\nFinance lease 5.9 6.9\nOperating leases 5.4 6.1\nWeighted-average discount rate:\nFinance lease 5.6 % 5.6 %\nOperating leases 5.7 % 6.0 %\nMaturities of Lease Liabilities\nFuture minimum lease payments under non-cancelable finance and operating leases on an annual undiscounted cash flow basis as of January 31, 2024\nwere as follows (in thousands):\nYear Ending January 31, Finance Lease Operating Leases\n2025 $ 8,445 $ 11,799 \n2026 8,711 9,304 \n2027 8,711 6,517 \n2028 8,711 5,697 \n2029 8,711 5,466 \nThereafter 7,985 7,999 \nTotal minimum payments51,274 46,782 \nLess imputed interest(7,584) (6,067)\nPresent value of future minimum lease payments43,690 40,715 \nLess current obligations under leases(6,179) (9,797)\nNon-current lease obligations $ 37,511 $ 30,918 \n92"
      }
    ]
  },
  {
    "company": "MONGODB",
    "question_type": "Numerical Reasoning",
    "question_type_kr": "숫자 추론",
    "question_en": "Is MongoDB a capital intensive business based on FY2022 data?",
    "question_kr": "FY2022 데이터 기준으로 MongoDB는 자본 집약적인 사업인가요?",
    "answer_en": "Yes, MongoDB is a capital intensive business. Generally for a business to be considered capital intensive, they require significant upfront capital to develop their product, acquire customers, and scale their operations. For software database companies, these costs often have to do with research & development, marketing, and sales efforts. For MongoDB, it's due to costs like these that the company has not reported a profit. In FY2022, their sales & marketing costs of $699.2 (in USD millions) was significantly higher than any other single cost reported on the statement of operations. Combined with their research & development of $421.7 (in USD millions), these 2 costs ate up majority of their total revenues alone. Due to these reasons, MongoDB would be considered a capital intensive business.",
    "answer_kr": "네, MongoDB는 자본 집약적인 사업입니다. 일반적으로 자본 집약적인 사업으로 간주되려면 제품 개발, 고객 확보 및 운영 확장을 위해 상당한 초기 자본이 필요합니다. 소프트웨어 데이터베이스 회사의 경우, 이러한 비용은 종종 연구개발(R&D), 마케팅 및 영업 활동과 관련이 있습니다. MongoDB의 경우, 이러한 비용 때문에 회사는 아직 이익을 보고하지 못했습니다. 2022 회계연도(FY2022)에서 MongoDB의 판매 및 마케팅 비용은 6억 9,920만 달러(미화)로, 운영 보고서에 보고된 다른 모든 비용보다 훨씬 높았습니다. 또한 연구개발 비용이 4억 2,170만 달러(미화)였으며, 이 두 가지 비용만으로도 전체 매출의 대부분을 차지했습니다. 이러한 이유들로 인해 MongoDB는 자본 집약적인 사업으로 분류될 수 있습니다.",
    "justification_en": "The figures used to support the conclusion of MongoDB being a capital intensive business were extracted from the company's consolidated statements of operations.",
    "justification_kr": "MongoDB가 자본 집약적인 사업이라는 결론을 뒷받침하는 수치는 회사의 연결 손익계산서에서 추출되었습니다.",
    "evidence": [
      {
        "source": "/korean_docs/MONGODB_FY2022_10K.pdf",
        "page_number": 68,
        "full_page_text": "Table of Contents\ncompany; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets\nthat could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of\neffectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance\nwith the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or\nrequired to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and\n(ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on\nthe consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the\ncritical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition - Allocation of Transaction Price in Revenue Arrangements with Multiple Performance Obligations\nAs described in Notes 2 and 10 to the consolidated financial statements, other subscription revenue was $426.9 million for the year ended January 31, 2023.\nCertain of the Company’s contracts with customers contain multiple performance obligations, such as the license portion of time-based software licenses, post-\ncontract customer support, and services. For these contracts that contain multiple performance obligations, management allocates the transaction price to each\nperformance obligation based on a relative standalone selling price. Management determines each standalone selling price based on multiple factors, including\npast history of selling such performance obligations as standalone products. Management estimates standalone selling price for performance obligations with no\nobservable evidence using adjusted market, cost plus and residual methods to establish the standalone selling prices. In cases where directly observable\nstandalone sales are not available, management utilizes all observable data points including competitor pricing for a similar or identical product, market and\nindustry data points, and the Company’s pricing practices.\nThe principal considerations for our determination that performing procedures relating to revenue recognition - allocation of transaction price in revenue\narrangements with multiple performance obligations is a critical audit matter are (i) the significant judgment by management in estimating the standalone selling\nprice for certain of the Company’s performance obligations and allocating the transaction price based on a relative allocation of standalone selling price to those\nindividual performance obligations, which in turn led to (ii) significant auditor judgment, subjectivity and effort in performing procedures and evaluating\nmanagement’s estimates of standalone selling price and the allocation of transaction price to the individual performance obligations.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated\nfinancial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process, including controls over the\nestimation of the standalone selling price and the allocation of transaction price to the individual performance obligations. These procedures also included\ntesting management’s process for estimating the standalone selling prices, which involved (i) evaluating the appropriateness of the methodologies used by\nmanagement in establishing the standalone selling prices; (ii) assessing the reasonableness of the significant assumptions developed by management; and (iii)\ntesting the source data utilized in management’s estimate calculations. These procedures also included testing the relative allocation of transaction price to\nindividual performance obligations based on a sample of contracts.\n/s/ PricewaterhouseCoopers LLP\nSan Jose, California\nMarch 17, 2023\nWe have served as the Company's auditor since 2013.\n66"
      }
    ]
  },
  {
    "company": "MONGODB",
    "question_type": "Logical Reasoning",
    "question_type_kr": "논리적 추론",
    "question_en": "Has MongoDB's quick ratio improved or declined between FY2023 and FY2022? If the quick ratio is not something that a financial analyst would ask about a company like this, then state that and explain why.",
    "question_kr": "2023 회계연도와 2022 회계연도 사이에 MongoDB의 당좌비율이 개선되었나요, 아니면 감소했나요? 당좌비율이 이러한 유형의 회사에 대해 재무 분석가가 주로 고려하지 않는 지표라면, 그 이유를 설명해 주세요.",
    "answer_en": "MongoDB's quick ratio has improved between FY2022 and FY2023. In FY2022, their quick ratio was 3.61 whereas in FY2023, their quick ratio increased to 4.15. There is no reason to indicate that the quick ratio may not be relevant for a company like MongoDB, so it has been used here.",
    "answer_kr": "MongoDB의 당좌 비율은 2022 회계연도(FY2022)와 2023 회계연도(FY2023) 사이에 개선되었습니다. 2022 회계연도에서는 당좌 비율이 3.61이었고, 2023 회계연도에서는 4.15로 증가했습니다. MongoDB와 같은 회사에서는 당좌 비율을 적절한 지표로 볼 수 있으므로, 이 지표가 여기서 사용되었습니다.",
    "justification_en": "The quick ratio formula is (cash & cash equivalents + short-term investments + accounts receivable) / current liabilities. Using this formula, the following quick ratio was computed (in USD thousands):\nFY2022 Quick Ratio = (455,826 + 1,380,804 + 285,192) / 588,512 = 3.61\nFY2023 Quick Ratio = (802,959 + 1,212,448 + 325,610) / 564,220 = 4.15\nThese numbers were pulled from the consolidated balance sheets.",
    "justification_kr": "당좌 비율 공식은 (현금 및 현금성 자산 + 단기 투자 + 매출채권) / 유동부채입니다. 이 공식을 사용하여 다음과 같은 당좌 비율을 계산하였습니다 (단위: 미화 천 달러): 2022 회계연도 당좌 비율 = (455,826 + 1,380,804 + 285,192) / 588,512 = 3.61\n2023 회계연도 당좌 비율 = (802,959 + 1,212,448 + 325,610) / 564,220 = 4.15\n이 숫자는 연결 재무상태표에서 추출되었습니다.",
    "evidence": [
      {
        "source": "/korean_docs/MONGODB_FY2023_10K.pdf",
        "page_number": 69,
        "full_page_text": "Table of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of MongoDB, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of MongoDB, Inc. and its subsidiaries (the “Company”) as of January 31, 2024 and 2023, and\nthe related consolidated statements of operations, of comprehensive loss, of stockholders’ equity and of cash flows for each of the three years in the period ended\nJanuary 31, 2024, including the related notes (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal\ncontrol over financial reporting as of January 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee\nof Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of January\n31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended January 31, 2024 in conformity with\naccounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective\ninternal control over financial reporting as of January 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the\nCOSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for\nits assessment of the effectiveness of internal control over financial reporting, included in Management’s Report on Internal Control over Financial Reporting\nappearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control\nover financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States)\n(PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and\nregulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable\nassurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal\ncontrol over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial\nstatements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence\nregarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and\nsignificant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control\nover financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and\ntesting and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other\nprocedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and\nthe preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over\nfinancial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the\ntransactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of\nfinancial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in\naccordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of\nunauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n67"
      }
    ]
  },
  {
    "company": "SNOWFLAKE",
    "question_type": "Information Extraction",
    "question_type_kr": "정보 추출",
    "question_en": "Assume that you are a public equities analyst. Answer the following question by primarily using information that is shown in the balance sheet: what is the year end FY2022 net PP&E for Snowflake? Answer in USD millions.",
    "question_kr": "여러분이 상장 주식 애널리스트라고 가정해 보겠습니다. 주로 대차대조표에 표시된 정보를 사용하여 다음 질문에 답하십시오: Snowflake의 2022 회계연도 말 순 PP&E는 얼마입니까? 백만 달러 단위로 답하세요.",
    "answer_en": "Snowflake's net PP&E balance for FY2022 is $160.823 (in USD millions).",
    "answer_kr": "Snowflake의 2022 회계연도(FY2022) 순 자산(PP&E) 잔액은 1억 6,082만 3,000달러(미화)입니다.",
    "justification_en": "This was located within their consolidate balance sheets under the line item \"property and equipment, net\".",
    "justification_kr": "이 정보는 회사의 연결 재무상태표에서 \"유형 자산, 순\" 항목에서 찾을 수 있습니다.",
    "evidence": [
      {
        "source": "/korean_docs/SNOWFLAKE_FY2022_10K.pdf",
        "page_number": 69,
        "full_page_text": "Table of Contents\nSNOWFLAKE INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share data)\nFiscal Year Ended January 31,\n2023 2022 2021\nRevenue $ 2,065,659 $ 1,219,327 $ 592,049 \nCost of revenue 717,540 458,433 242,588 \nGross profit 1,348,119 760,894 349,461 \nOperating expenses:\nSales and marketing 1,106,507 743,965 479,317 \nResearch and development 788,058 466,932 237,946 \nGeneral and administrative 295,821 265,033 176,135 \nTotal operating expenses 2,190,386 1,475,930 893,398 \nOperating loss (842,267) (715,036) (543,937)\nInterest income 73,839 9,129 7,507 \nOther income (expense), net (47,565) 28,947 (610)\nLoss before income taxes (815,993) (676,960) (537,040)\nProvision for (benefit from) income taxes (18,467) 2,988 2,062 \nNet loss (797,526) (679,948) (539,102)\nLess: net loss attributable to noncontrolling interest (821) — — \nNet loss attributable to Snowflake Inc. $ (796,705)$ (679,948)$ (539,102)\nNet loss per share attributable to Snowflake Inc. Class A and Class B common stockholders—\nbasic and diluted $ (2.50)$ (2.26)$ (3.81)\nWeighted-average shares used in computing net loss per share attributable to Snowflake Inc.\nClass A and Class B common stockholders—basic and diluted 318,730 300,273 141,613 \n________________\nOn March 1, 2021, all shares of the Company’s then-outstanding Class B common stock were automatically converted into the same number of shares of Class A common stock, pursuant to the terms of the Company’s amended and restated\ncertificate of incorporation. No additional shares of Class B common stock will be issued following such conversion. See Note 12 for further details.\nSee accompanying notes to consolidated financial statements.(1)\n(1)\n(1)    \n70"
      }
    ]
  }
]