[{"company": "DATADOG", "question_type": "Information Extraction", "question_type_kr": "정보 추출", "question_en": "By drawing conclusions from the information stated only in the income statement, what is Datadog's FY2021 net income attributable to shareholders (in USD millions)?", "question_kr": "손익 계산서의 정보만을 바탕으로 결론을 내릴 때, 2021 회계 연도에 주주에게 귀속되는 Datadog의 순이익은 얼마입니까(미화 백만 달러 기준)?", "answer_en": "Datadog reported a net loss in FY2021. The net loss amounted to $20.745 (in USD millions)", "answer_kr": "Datadog는 2021 회계연도(FY2021)에서 순손실을 보고했습니다. 순손실은 2,074만 5천 달러(미화)였습니다.", "justification_en": "This information was found within the company's 10-K, in their statements of comprehensive loss as well as statements of operations.", "justification_kr": "이 정보는 회사의 10-K 보고서에서 포괄손익계산서와 손익계산서에 포함되어 있습니다.", "evidence": [{"source": "/korean_docs/DATADOG_FY2021_10K.pdf", "page_number": 58, "full_page_text": ""}, {"source": "/korean_docs/DATADOG_FY2021_10K.pdf", "page_number": 59, "full_page_text": ""}]},
{"company": "DATADOG", "question_type": "Information Extraction", "question_type_kr": "정보 추출", "question_en": "What industry does Datadog primarily operate in?", "question_kr": "Datadog은 주로 어떤 산업에서 운영되나요?", "answer_en": "Datadog operates within the software as a service (SaaS) industry.", "answer_kr": "Datadog는 소프트웨어 서비스(SaaS) 산업 내에서 운영됩니다.", "justification_en": "This information was extrapolated from their Business Overview section within their 10-K.", "justification_kr": "이 정보는 회사의 10-K 보고서 내 사업 개요 섹션에서 추출되었습니다.", "evidence": [{"source": "/korean_docs/DATADOG_FY2021_10K.pdf", "page_number": 5, "full_page_text": ""}]},
{"company": "DATADOG", "question_type": "Numerical Reasoning", "question_type_kr": "숫자 추론", "question_en": "Has Datadog increased its debt on balance sheet between FY2023 and the FY2022 period?", "question_kr": "Datadog의 재무제표상 부채가 FY2023과 FY2022 기간 사이에 증가했나요?", "answer_en": "Yes, Datadog's debt on their balance sheet has increased. Although they do not report any short-term or long-term debt, their total liabilities has increased from $1,594.3 (in USD millions) in 2022, to $1,910.7 (in USD millions) in 2023.", "answer_kr": "네, Datadog의 재무제표에서 부채가 증가했습니다. 비록 단기 부채나 장기 부채는 보고되지 않았지만, 총 부채는 2022년 15억 9,430만 달러(미화)에서 2023년 19억 1,070만 달러(미화)로 증가했습니다.", "justification_en": "This information was extracted from company's FY2023 10-K, specifically within the consolidated balance sheets.", "justification_kr": "이 정보는 회사의 2023 회계연도 10-K 보고서에서 추출되었으며, 특히 연결 재무상태표 내에서 찾을 수 있습니다.", "evidence": [{"source": "/korean_docs/DATADOG_FY2023_10K.pdf", "page_number": 59, "full_page_text": ""}]},
{"company": "DATADOG", "question_type": "Logical Reasoning", "question_type_kr": "논리적 추론", "question_en": "Does Datadog have a reasonably healthy liquidity profile based on its quick ratio for FY2023? If the quick ratio is not relevant to measure liquidity, please state that and explain why.", "question_kr": "Datadog은 2023 회계연도의 당좌 비율에 근거하여 유동성 프로필이 상당히 건전한가요? 당좌 비율이 유동성 측정과 관련이 없는 경우, 그 이유를 설명해 주세요.", "answer_en": "Yes Datadog has a healthy liquidity profile based on their quick ratio for FY2023 as it is 3.08. Generally, any number greater than 1 is considered healthy as it indicates that the company would sufficiently be able to cover their current liabilities with their most liquid assets should any circumstance require. Datadog has a very healthy ratio as it is more than 3 times enough to cover the company's current liabilities. There is no reason to indicate that the quick ratio may not be the most ideal to measure Datadog's liquidity, so it has been used here.", "answer_kr": "네, Datadog는 2023 회계연도(FY2023) 기준으로 당좌 비율이 3.08로 건강한 유동성 프로필을 보이고 있습니다. 일반적으로 1보다 큰 수치는 건강한 것으로 간주되며, 이는 회사가 가장 유동적인 자산으로 현재 부채를 충분히 상환할 수 있다는 것을 의미합니다.  Datadog는 현재 부채를 3배 이상 충분히 커버할 수 있는 매우 건강한 비율을 보이고 있습니다. 당좌 비율이  Datadog의 유동성을 측정하는 데 적합한 지표이므로, 이 지표가 여기서 사용되었습니다.", "justification_en": "The quick ratio formula is (cash & cash equivalents + marketable securities + accounts receivable) / current liabilities. Using this formula, the following quick ratio was computed (in USD thousands):\nFY2023 Quick Ratio = (330,339 + 2,252,559 + 509,279) / 1,003,052 = 3.08\nThese numbers were pulled from the consolidated balance sheets.", "justification_kr": "당좌 비율 공식은 (현금 및 현금성 자산 + 매도가능 증권 + 매출채권) / 유동부채입니다. 이 공식을 사용하여 다음과 같은 당좌 비율을 계산하였습니다 (단위: 미화 천 달러): 2023 회계연도 당좌 비율 = (330,339 + 2,252,559 + 509,279) / 1,003,052 = 3.08 이 숫자는 연결 재무상태표에서 추출되었습니다.", "evidence": [{"source": "/korean_docs/DATADOG_FY2023_10K.pdf", "page_number": 59, "full_page_text": ""}]},
{"company": "MONGODB", "question_type": "Information Extraction", "question_type_kr": "정보 추출", "question_en": "What is the FY2022 COGS for MongoDB? Please state answer in USD millions. Provide a response to the question by primarily using the statement of income.", "question_kr": "MongoDB의 FY2022 COGS는 얼마입니까? 백만 달러 단위로 답변해 주세요. 주로 손익 계산서를 사용하여 질문에 대한 답변을 제공하세요.", "answer_en": "The FY2022 cost of revenue (which is used in place of COGS for MongoDB) is $349.304 (in USD millions). \n\nNote: MongoDB's business year-end is not Dec 31 but rather Jan 31. As such, their COGS for Jan 31, 2023 was used as this encapsulates majority of the year of 2022.", "answer_kr": "2022 회계연도의 매출원가(MongoDB의 경우 COGS 대신 사용됨)는 3억 4,930만 달러(미화)입니다.\n\n참고: MongoDB의 사업 연도는 12월 31일이 아니라 1월 31일입니다. 따라서 2023년 1월 31일의 COGS가 사용되었으며, 이는 2022년의 대부분을 포함하고 있습니다.", "justification_en": "This information was found within the consolidated statements of operations, under the line item \"total cost of revenue\".", "justification_kr": "이 정보는 연결 손익계산서에서 \"총 매출원가(total cost of revenue)\" 항목에서 찾을 수 있습니다.", "evidence": [{"source": "/korean_docs/MONGODB_FY2022_10K.pdf", "page_number": 68, "full_page_text": ""}]},
{"company": "MONGODB", "question_type": "Information Extraction", "question_type_kr": "정보 추출", "question_en": "What are the geographies that MongoDB primarily operates in as of FY2023?", "question_kr": "2023 회계연도 기준으로 MongoDB가 주로 운영되는 지역은 어디인가요?", "answer_en": "The geographies that MongoDB primarily operates in for FY2023 are the following 3 areas: Americas (North America and South America), EMEA (Europe, Middle East, and Africa), and Asia Pacific.", "answer_kr": "MongoDB가 2023 회계연도(FY2023) 동안 주로 운영하는 곳은 다음의 세 지역입니다: 미주(북미와 남미), EMEA(유럽, 중동, 아프리카), 아시아 태평양 지역.", "justification_en": "This information was stated within their 10-K under the notes to consolidated financial statements section. Within note 9, their disaggregation of revenue, they plainly state \"the company’s primary geographical markets are North and South America (“Americas”); Europe, Middle East and Africa (“EMEA”); and Asia Pacific.", "justification_kr": "이 정보는 회사의 10-K 보고서 연결 재무제표 주석 섹션에 명시되어 있습니다. 주석 9, 수익의 세분화 항목에서, 회사는 \"회사의 주요 지리적 시장은 북미 및 남미(‘미주’), 유럽, 중동 및 아프리카(‘EMEA’), 아시아 태평양 지역(‘아시아 태평양’)\"이라고 명확히 언급하고 있습니다.", "evidence": [{"source": "/korean_docs/MONGODB_FY2023_10K.pdf", "page_number": 94, "full_page_text": ""}]},
{"company": "MONGODB", "question_type": "Numerical Reasoning", "question_type_kr": "숫자 추론", "question_en": "Is MongoDB a capital intensive business based on FY2022 data?", "question_kr": "FY2022 데이터 기준으로 MongoDB는 자본 집약적인 사업인가요?", "answer_en": "Yes, MongoDB is a capital intensive business. Generally for a business to be considered capital intensive, they require significant upfront capital to develop their product, acquire customers, and scale their operations. For software database companies, these costs often have to do with research & development, marketing, and sales efforts. For MongoDB, it's due to costs like these that the company has not reported a profit. In FY2022, their sales & marketing costs of $699.2 (in USD millions) was significantly higher than any other single cost reported on the statement of operations. Combined with their research & development of $421.7 (in USD millions), these 2 costs ate up majority of their total revenues alone. Due to these reasons, MongoDB would be considered a capital intensive business.", "answer_kr": "네, MongoDB는 자본 집약적인 사업입니다. 일반적으로 자본 집약적인 사업으로 간주되려면 제품 개발, 고객 확보 및 운영 확장을 위해 상당한 초기 자본이 필요합니다. 소프트웨어 데이터베이스 회사의 경우, 이러한 비용은 종종 연구개발(R&D), 마케팅 및 영업 활동과 관련이 있습니다. MongoDB의 경우, 이러한 비용 때문에 회사는 아직 이익을 보고하지 못했습니다. 2022 회계연도(FY2022)에서 MongoDB의 판매 및 마케팅 비용은 6억 9,920만 달러(미화)로, 운영 보고서에 보고된 다른 모든 비용보다 훨씬 높았습니다. 또한 연구개발 비용이 4억 2,170만 달러(미화)였으며, 이 두 가지 비용만으로도 전체 매출의 대부분을 차지했습니다. 이러한 이유들로 인해 MongoDB는 자본 집약적인 사업으로 분류될 수 있습니다.", "justification_en": "The figures used to support the conclusion of MongoDB being a capital intensive business were extracted from the company's consolidated statements of operations.", "justification_kr": "MongoDB가 자본 집약적인 사업이라는 결론을 뒷받침하는 수치는 회사의 연결 손익계산서에서 추출되었습니다.", "evidence": [{"source": "/korean_docs/MONGODB_FY2022_10K.pdf", "page_number": 68, "full_page_text": ""}]},
{"company": "MONGODB", "question_type": "Logical Reasoning", "question_type_kr": "논리적 추론", "question_en": "Has MongoDB's quick ratio improved or declined between FY2023 and FY2022? If the quick ratio is not something that a financial analyst would ask about a company like this, then state that and explain why.", "question_kr": "2023 회계연도와 2022 회계연도 사이에 MongoDB의 당좌비율이 개선되었나요, 아니면 감소했나요? 당좌비율이 이러한 유형의 회사에 대해 재무 분석가가 주로 고려하지 않는 지표라면, 그 이유를 설명해 주세요.", "answer_en": "MongoDB's quick ratio has improved between FY2022 and FY2023. In FY2022, their quick ratio was 3.61 whereas in FY2023, their quick ratio increased to 4.15. There is no reason to indicate that the quick ratio may not be relevant for a company like MongoDB, so it has been used here.", "answer_kr": "MongoDB의 당좌 비율은 2022 회계연도(FY2022)와 2023 회계연도(FY2023) 사이에 개선되었습니다. 2022 회계연도에서는 당좌 비율이 3.61이었고, 2023 회계연도에서는 4.15로 증가했습니다. MongoDB와 같은 회사에서는 당좌 비율을 적절한 지표로 볼 수 있으므로, 이 지표가 여기서 사용되었습니다.", "justification_en": "The quick ratio formula is (cash & cash equivalents + short-term investments + accounts receivable) / current liabilities. Using this formula, the following quick ratio was computed (in USD thousands):\nFY2022 Quick Ratio = (455,826 + 1,380,804 + 285,192) / 588,512 = 3.61\nFY2023 Quick Ratio = (802,959 + 1,212,448 + 325,610) / 564,220 = 4.15\nThese numbers were pulled from the consolidated balance sheets.", "justification_kr": "당좌 비율 공식은 (현금 및 현금성 자산 + 단기 투자 + 매출채권) / 유동부채입니다. 이 공식을 사용하여 다음과 같은 당좌 비율을 계산하였습니다 (단위: 미화 천 달러): 2022 회계연도 당좌 비율 = (455,826 + 1,380,804 + 285,192) / 588,512 = 3.61\n2023 회계연도 당좌 비율 = (802,959 + 1,212,448 + 325,610) / 564,220 = 4.15\n이 숫자는 연결 재무상태표에서 추출되었습니다.", "evidence": [{"source": "/korean_docs/MONGODB_FY2023_10K.pdf", "page_number": 69, "full_page_text": ""}]},
{"company": "SNOWFLAKE", "question_type": "Information Extraction", "question_type_kr": "정보 추출", "question_en": "Assume that you are a public equities analyst. Answer the following question by primarily using information that is shown in the balance sheet: what is the year end FY2022 net PP&E for Snowflake? Answer in USD millions.", "question_kr": "여러분이 상장 주식 애널리스트라고 가정해 보겠습니다. 주로 대차대조표에 표시된 정보를 사용하여 다음 질문에 답하십시오: Snowflake의 2022 회계연도 말 순 PP&E는 얼마입니까? 백만 달러 단위로 답하세요.", "answer_en": "Snowflake's net PP&E balance for FY2022 is $160.823 (in USD millions).", "answer_kr": "Snowflake의 2022 회계연도(FY2022) 순 자산(PP&E) 잔액은 1억 6,082만 3,000달러(미화)입니다.", "justification_en": "This was located within their consolidate balance sheets under the line item \"property and equipment, net\".", "justification_kr": "이 정보는 회사의 연결 재무상태표에서 \"유형 자산, 순\" 항목에서 찾을 수 있습니다.", "evidence": [{"source": "/korean_docs/SNOWFLAKE_FY2022_10K.pdf", "page_number": 69, "full_page_text": ""}]}
]